/**
 * 湖北安式软件有限公司
 * Hubei Anssy Software Co., Ltd.
 * FILENAME     :  CodeEnum.java
 * PACKAGE      :  com.anssy.inter
 * CREATE DATE  :  2016-8-10
 * AUTHOR       :  make it
 * MODIFIED BY  :
 * DESCRIPTION  :
 */
package com.anssy.inter;

/**
 * @author make it
 * @version SVN #V1# #2016-8-10#
 */
public enum CodeEnum {

    CODE0("操作成功!", 0),

    CODE10("删除图片失败!", 10),

    CODE20("发布留言失败!", 20),

    CODE30("收藏失败!", 30),
    CODE31("取消收藏失败!", 31),
    CODE32("已收藏!", 32),
    CODE33("未收藏!", 33),

    CODE40("留言信息不存在!", 40),
    CODE41("留言查看人不匹配!", 41),
    CODE42("已阅留言成功!", 42),
    CODE43("已阅留言失败!", 43),

    CODE50("修改权重失败!", 50),

    CODE404("404!", 404),
    CODE500("处理遇到异常!", 500),
    CODE1001("缺少userId,sign参数!", 1001),
    CODE1002("sign参数错误!", 1002),
    CODE1003("参数异常!", 1003),
    CODE1004("userId不匹配!", 1004),
    CODE1005("手机号码格式异常!", 1005),
    CODE1006("邮箱格式异常!", 1006),

    CODE2001("注册失败!", 2001),
    CODE2002("此号码已被注册!", 2002),
    CODE2003("此用户不存在!", 2003),
    CODE2004("用户被锁定!", 2004),
    CODE2005("用户邮箱未激活!", 2005),
    CODE2006("密码错误!", 2006),
    CODE2007("激活成功!", 2007),
    CODE2008("激活失败!", 2008),
    CODE2009("没有邮箱地址!", 2009),
    CODE2010("没有此用户信息!", 2010),
    CODE2011("修改密码失败!", 2011),
    CODE2012("此邮箱已被注册!", 2012),
    CODE2013("发送验证码失败!", 2013),
    CODE2014("验证码失效!", 2014),
    CODE2015("验证码错误!", 2015),

    CODE3001("发布场地信息失败!", 3001),
    CODE3002("查询场地信息失败!", 3002),
    CODE3003("场地信息不存在!", 3003),
    CODE3004("删除场地信息失败!", 3004),
    CODE3005("场地信息点赞失败!", 3005),
    CODE3006("修改场地信息失败!", 3006),

    CODE4001("发布投资人信息失败!", 4001),
    CODE4002("查询投资人信息失败!", 4002),
    CODE4003("投资人信息不存在!", 4003),
    CODE4004("删除投资人信息失败!", 4004),
    CODE4005("投资人信息点赞失败!", 4005),
    CODE4006("修改投资人信息失败!", 4006),

    CODE5001("发布投资项目信息失败!", 5001),
    CODE5002("查询投资项目信息失败!", 5002),
    CODE5003("投资项目信息不存在!", 5003),
    CODE5004("删除投资项目信息失败!", 5004),
    CODE5005("投资项目信息点赞失败!", 5005),
    CODE5006("修改投资项目信息失败!", 5006),

    CODE6001("发布众包信息失败!", 6001),
    CODE6002("查询众包信息失败!", 6002),
    CODE6003("众包信息不存在!", 6003),
    CODE6004("删除众包信息失败!", 6004),
    CODE6005("众包信息点赞失败!", 6005),
    CODE6006("修改众包信息失败!", 6006),

    CODE7001("发布合伙信息失败!", 7001),
    CODE7002("查询合伙信息失败!", 7002),
    CODE7003("合伙信息不存在!", 7003),
    CODE7004("删除合伙信息失败!", 7004),
    CODE7005("合伙信息点赞失败!", 7005),
    CODE7006("修改合伙信息失败!", 7006),

    CODE8001("发布导师信息失败!", 8001),
    CODE8002("查询导师信息失败!", 8002),
    CODE8003("导师信息不存在!", 8003),
    CODE8004("删除导师信息失败!", 8004),
    CODE8005("导师信息点赞失败!", 8005),
    CODE8006("修改导师信息失败!", 8006),

    CODE9001("发布服务信息失败!", 9001),
    CODE9002("查询服务信息失败!", 9002),
    CODE9003("服务信息不存在!", 9003),
    CODE9004("删除服务信息失败!", 9004),
    CODE9005("服务信息点赞失败!", 9005),
    CODE9006("修改服务信息失败!", 9006),

    CODE10001("发布活动信息失败!", 10001),
    CODE10002("查询活动信息失败!", 10002),
    CODE10003("活动信息不存在!", 10003),
    CODE10004("删除活动信息失败!", 10004),
    CODE10005("活动信息点赞失败!", 10005),
    CODE10006("参与活动失败!", 10006),
    CODE10007("关注活动失败!", 10007),
    CODE10008("您已参与此活动!", 10008),
    CODE10009("您已关注此活动!", 10009),
    CODE10010("修改活动信息失败!", 10010),

    CODE11001("发布政策信息失败!", 11001),
    CODE11002("查询政策信息失败!", 11002),
    CODE11003("政策信息不存在!", 11003),
    CODE11004("删除政策信息失败!", 11004),
    CODE11005("政策信息点赞失败!", 11005),
    CODE11006("修改政策信息失败!", 11006);


    private String msg;
    private int code;

    // 构造方法
    private CodeEnum(String msg, int code) {
        this.msg = msg;
        this.code = code;
    }

    // 普通方法
    public static String getName(Integer code) {
        for (CodeEnum c : CodeEnum.values()) {
            if (c.getCode() == code) {
                return c.msg;
            }
        }
        return "";
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

}